# How To Condtruct The Pandas DataFrame Objects

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame?

In [3]:
states_capitals = {'Karnataka':'Bangalore', 'Andrapradesh':'Hyderabad', 
                   'Tamilnadu':'Chennai', 'Kerala':'Thiruvanathapuram', 'Maharastra':'Mumbai'}

In [4]:
states_lang = {'Karnataka':'Kannada', 'Andrapradesh':'Telugu', 
                 'Tamilnadu':'Tamil', 'Kerala':'Malayalam', 'Maharastra':'Hindi'}

In [5]:
states_CL = pd.DataFrame({'Capitals': states_capitals, 'Language': states_lang})
states_CL

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [6]:
print(states_CL)

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [7]:
d_list = {'a':[0, 1, 2 ,3, 4], 'b':[0,2,4,6,8], 'c': [0,3,6,9,12]}
d_list

{'a': [0, 1, 2, 3, 4], 'b': [0, 2, 4, 6, 8], 'c': [0, 3, 6, 9, 12]}

In [8]:
df_list = pd.DataFrame(d_list)
df_list

   a  b   c
0  0  0   0
1  1  2   3
2  2  4   6
3  3  6   9
4  4  8  12

In [9]:
data = [{'a': i, 'b': 2 * i, 'c': 3*i} for i in range(5)]
data

[{'a': 0, 'b': 0, 'c': 0},
 {'a': 1, 'b': 2, 'c': 3},
 {'a': 2, 'b': 4, 'c': 6},
 {'a': 3, 'b': 6, 'c': 9},
 {'a': 4, 'b': 8, 'c': 12}]

In [10]:
data_df = pd.DataFrame(data)
data_df

   a  b   c
0  0  0   0
1  1  2   3
2  2  4   6
3  3  6   9
4  4  8  12

In [11]:
states_CL = pd.DataFrame({'Capitals':pd.Series(states_capitals), 'Language': pd.Series(states_lang)})
states_CL

                       Capitals   Language
Karnataka             Bangalore    Kannada
Andrapradesh          Hyderabad     Telugu
Tamilnadu               Chennai      Tamil
Kerala        Thiruvanathapuram  Malayalam
Maharastra               Mumbai      Hindi

In [12]:
df_np = pd.DataFrame(np.random.randn(6, 3), index=['A','B','C','D', 'E','F'], columns=['one', 'two', 'three'])
df_np

        one       two     three
A -0.451764  0.615211 -0.681055
B  3.200366  1.928434 -0.737822
C  0.141453 -0.594771  0.170480
D -0.913678 -0.408778  0.367866
E -0.014720 -0.035964  0.236214
F -0.064065 -0.632612  1.094218

In [13]:
A = np.zeros(5, dtype=[('A', 'i'), ('B', 'f')])
A

array([(0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.)],
      dtype=[('A', '<i4'), ('B', '<f4')])

In [14]:
A_df = pd.DataFrame(A)

In [15]:
A_df

   A    B
0  0  0.0
1  0  0.0
2  0  0.0
3  0  0.0
4  0  0.0

In [17]:
csv_df = pd.read_csv('dataset/Marks_list.csv')
csv_df

  Student_Name   Sub1   Sub2   Sub3   Sub4   Sub5   Sub6
0     Student1     25     10     10     15     15     16
1     Student2     23     15     15     15     15     17
2     Student3     21     11     12     16     15     19
3     Student4     22     12     15     12     18     15
4     Student5     21     15     16     16     17     18
5     Student6     20     18     17     18     16     17
6     Student7     20     19     18     13     17     19
7     Student8     22     20     15     17     18     20
8     Student9     21     22     14     18     16     23
9    Student10     15     20     15     19     17     25